aysagent/meshpn/device/boards/xiao_esp32s3/sdkconfig.defaults
# XIAO ESP32-S3 board defaults

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# PSRAM (ESP32-S3R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# HTTPS allocations must leave internal SRAM for USB/WiFi DMA and task stacks.
# PSRAM/flash are not encrypted at rest in this development firmware.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Throughput phase 3b: WiFi buffers in PSRAM + larger AMPDU windows for NAT bursts
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=48
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=24
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=48
CONFIG_ESP_WIFI_TX_BA_WIN=16
CONFIG_ESP_WIFI_RX_BA_WIN=32
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=y

CONFIG_TINYUSB_TASK_AFFINITY_CPU1=y
CONFIG_TINYUSB_INIT_IN_DEFAULT_TASK=y
CONFIG_TINYUSB_TASK_PRIORITY=6

# TinyUSB device mode owns the USB PHY. Leaving USB-Serial-JTAG enabled makes
# iPhone Ethernet enumerate unreliably on some hosts.
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=n

# Brownout: the board is often bus-powered by a phone, where the WiFi TX
# current spike can dip the rail. Log it instead of silently resetting.
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
